; domain
(define (domain grid)
(:requirements :strips :typing)
(:predicates (conn ?x ?y)
             (at ?r ?x )
	           (at-robot ?x ?r)
             (place ?p)
             (open ?x)
             (is-goal ?x)
             (is-goal-dangerous ?x)
)

(:action move
:parameters (?curpos ?nextpos ?robot)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos ?robot) (conn ?curpos ?nextpos) (open ?nextpos))
:effect 
  (and 
    (not (at-robot ?curpos ?robot)) 
    (at-robot ?nextpos ?robot)
  )
)

(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)


)

; problem
(define (problem maze-problem)
  (:domain grid)
  (:objects
    robot
    node0-0 node0-1 node0-2 node0-3 node0-4 node0-5 node0-6 node0-7 node0-8 node0-9 node0-10 node0-11 node0-12 node1-0 node1-1 node1-2 node1-3 node1-4 node1-5 node1-6 node1-7 node1-8 node1-9 node1-10 node1-11 node1-12 node2-0 node2-1 node2-2 node2-3 node2-4 node2-5 node2-6 node2-7 node2-8 node2-9 node2-10 node2-11 node2-12 node3-0 node3-1 node3-2 node3-3 node3-4 node3-5 node3-6 node3-7 node3-8 node3-9 node3-10 node3-11 node3-12 node4-0 node4-1 node4-2 node4-3 node4-4 node4-5 node4-6 node4-7 node4-8 node4-9 node4-10 node4-11 node4-12 node5-0 node5-1 node5-2 node5-3 node5-4 node5-5 node5-6 node5-7 node5-8 node5-9 node5-10 node5-11 node5-12 node6-0 node6-1 node6-2 node6-3 node6-4 node6-5 node6-6 node6-7 node6-8 node6-9 node6-10 node6-11 node6-12 node7-0 node7-1 node7-2 node7-3 node7-4 node7-5 node7-6 node7-7 node7-8 node7-9 node7-10 node7-11 node7-12 node8-0 node8-1 node8-2 node8-3 node8-4 node8-5 node8-6 node8-7 node8-8 node8-9 node8-10 node8-11 node8-12 node9-0 node9-1 node9-2 node9-3 node9-4 node9-5 node9-6 node9-7 node9-8 node9-9 node9-10 node9-11 node9-12 node10-0 node10-1 node10-2 node10-3 node10-4 node10-5 node10-6 node10-7 node10-8 node10-9 node10-10 node10-11 node10-12 node11-0 node11-1 node11-2 node11-3 node11-4 node11-5 node11-6 node11-7 node11-8 node11-9 node11-10 node11-11 node11-12 node12-0 node12-1 node12-2 node12-3 node12-4 node12-5 node12-6 node12-7 node12-8 node12-9 node12-10 node12-11 node12-12
  )
  (:init
    (at-robot node1-1 robot)
    (is-goal node1-10)
    (is-goal node7-9)
    (is-goal node11-7)
    (is-goal-dangerous node7-11)
    (is-goal-dangerous node11-4)
    (place node0-0)
    (place node0-1)
    (place node0-2)
    (place node0-3)
    (place node0-4)
    (place node0-5)
    (place node0-6)
    (place node0-7)
    (place node0-8)
    (place node0-9)
    (place node0-10)
    (place node0-11)
    (place node0-12)
    (place node1-0)
    (place node1-1)
    (place node1-2)
    (place node1-3)
    (place node1-4)
    (place node1-5)
    (place node1-6)
    (place node1-7)
    (place node1-8)
    (place node1-9)
    (place node1-10)
    (place node1-11)
    (place node1-12)
    (place node2-0)
    (place node2-1)
    (place node2-2)
    (place node2-3)
    (place node2-4)
    (place node2-5)
    (place node2-6)
    (place node2-7)
    (place node2-8)
    (place node2-9)
    (place node2-10)
    (place node2-11)
    (place node2-12)
    (place node3-0)
    (place node3-1)
    (place node3-2)
    (place node3-3)
    (place node3-4)
    (place node3-5)
    (place node3-6)
    (place node3-7)
    (place node3-8)
    (place node3-9)
    (place node3-10)
    (place node3-11)
    (place node3-12)
    (place node4-0)
    (place node4-1)
    (place node4-2)
    (place node4-3)
    (place node4-4)
    (place node4-5)
    (place node4-6)
    (place node4-7)
    (place node4-8)
    (place node4-9)
    (place node4-10)
    (place node4-11)
    (place node4-12)
    (place node5-0)
    (place node5-1)
    (place node5-2)
    (place node5-3)
    (place node5-4)
    (place node5-5)
    (place node5-6)
    (place node5-7)
    (place node5-8)
    (place node5-9)
    (place node5-10)
    (place node5-11)
    (place node5-12)
    (place node6-0)
    (place node6-1)
    (place node6-2)
    (place node6-3)
    (place node6-4)
    (place node6-5)
    (place node6-6)
    (place node6-7)
    (place node6-8)
    (place node6-9)
    (place node6-10)
    (place node6-11)
    (place node6-12)
    (place node7-0)
    (place node7-1)
    (place node7-2)
    (place node7-3)
    (place node7-4)
    (place node7-5)
    (place node7-6)
    (place node7-7)
    (place node7-8)
    (place node7-9)
    (place node7-10)
    (place node7-11)
    (place node7-12)
    (place node8-0)
    (place node8-1)
    (place node8-2)
    (place node8-3)
    (place node8-4)
    (place node8-5)
    (place node8-6)
    (place node8-7)
    (place node8-8)
    (place node8-9)
    (place node8-10)
    (place node8-11)
    (place node8-12)
    (place node9-0)
    (place node9-1)
    (place node9-2)
    (place node9-3)
    (place node9-4)
    (place node9-5)
    (place node9-6)
    (place node9-7)
    (place node9-8)
    (place node9-9)
    (place node9-10)
    (place node9-11)
    (place node9-12)
    (place node10-0)
    (place node10-1)
    (place node10-2)
    (place node10-3)
    (place node10-4)
    (place node10-5)
    (place node10-6)
    (place node10-7)
    (place node10-8)
    (place node10-9)
    (place node10-10)
    (place node10-11)
    (place node10-12)
    (place node11-0)
    (place node11-1)
    (place node11-2)
    (place node11-3)
    (place node11-4)
    (place node11-5)
    (place node11-6)
    (place node11-7)
    (place node11-8)
    (place node11-9)
    (place node11-10)
    (place node11-11)
    (place node11-12)
    (place node12-0)
    (place node12-1)
    (place node12-2)
    (place node12-3)
    (place node12-4)
    (place node12-5)
    (place node12-6)
    (place node12-7)
    (place node12-8)
    (place node12-9)
    (place node12-10)
    (place node12-11)
    (place node12-12)
    (open node1-1)
    (open node1-2)
    (open node1-3)
    (open node1-4)
    (open node1-6)
    (open node1-7)
    (open node1-8)
    (open node1-9)
    (open node1-10)
    (open node1-11)
    (open node2-1)
    (open node2-4)
    (open node2-5)
    (open node2-6)
    (open node2-11)
    (open node3-1)
    (open node3-4)
    (open node3-5)
    (open node3-6)
    (open node3-11)
    (open node4-1)
    (open node4-2)
    (open node4-3)
    (open node4-4)
    (open node4-6)
    (open node4-7)
    (open node4-8)
    (open node4-9)
    (open node4-10)
    (open node4-11)
    (open node5-2)
    (open node5-3)
    (open node5-6)
    (open node5-7)
    (open node5-9)
    (open node5-11)
    (open node6-1)
    (open node6-2)
    (open node6-3)
    (open node6-4)
    (open node6-5)
    (open node6-6)
    (open node6-7)
    (open node6-9)
    (open node6-11)
    (open node7-1)
    (open node7-4)
    (open node7-7)
    (open node7-9)
    (open node7-11)
    (open node8-1)
    (open node8-4)
    (open node8-7)
    (open node8-11)
    (open node9-1)
    (open node9-2)
    (open node9-3)
    (open node9-4)
    (open node9-5)
    (open node9-6)
    (open node9-7)
    (open node9-8)
    (open node9-9)
    (open node9-10)
    (open node9-11)
    (open node10-1)
    (open node10-4)
    (open node10-7)
    (open node10-10)
    (open node11-1)
    (open node11-4)
    (open node11-7)
    (open node11-10)
    (conn node1-1 node2-1)
    (conn node1-1 node1-2)
    (conn node1-2 node1-1)
    (conn node1-2 node1-3)
    (conn node1-3 node1-2)
    (conn node1-3 node1-4)
    (conn node1-4 node2-4)
    (conn node1-4 node1-3)
    (conn node1-6 node2-6)
    (conn node1-6 node1-7)
    (conn node1-7 node1-6)
    (conn node1-7 node1-8)
    (conn node1-8 node1-7)
    (conn node1-8 node1-9)
    (conn node1-9 node1-8)
    (conn node1-9 node1-10)
    (conn node1-10 node1-9)
    (conn node1-10 node1-11)
    (conn node1-11 node2-11)
    (conn node1-11 node1-10)
    (conn node2-1 node1-1)
    (conn node2-1 node3-1)
    (conn node2-4 node1-4)
    (conn node2-4 node3-4)
    (conn node2-4 node2-5)
    (conn node2-5 node3-5)
    (conn node2-5 node2-4)
    (conn node2-5 node2-6)
    (conn node2-6 node1-6)
    (conn node2-6 node3-6)
    (conn node2-6 node2-5)
    (conn node2-11 node1-11)
    (conn node2-11 node3-11)
    (conn node3-1 node2-1)
    (conn node3-1 node4-1)
    (conn node3-4 node2-4)
    (conn node3-4 node4-4)
    (conn node3-4 node3-5)
    (conn node3-5 node2-5)
    (conn node3-5 node3-4)
    (conn node3-5 node3-6)
    (conn node3-6 node2-6)
    (conn node3-6 node4-6)
    (conn node3-6 node3-5)
    (conn node3-11 node2-11)
    (conn node3-11 node4-11)
    (conn node4-1 node3-1)
    (conn node4-1 node4-2)
    (conn node4-2 node5-2)
    (conn node4-2 node4-1)
    (conn node4-2 node4-3)
    (conn node4-3 node5-3)
    (conn node4-3 node4-2)
    (conn node4-3 node4-4)
    (conn node4-4 node3-4)
    (conn node4-4 node4-3)
    (conn node4-6 node3-6)
    (conn node4-6 node5-6)
    (conn node4-6 node4-7)
    (conn node4-7 node5-7)
    (conn node4-7 node4-6)
    (conn node4-7 node4-8)
    (conn node4-8 node4-7)
    (conn node4-8 node4-9)
    (conn node4-9 node5-9)
    (conn node4-9 node4-8)
    (conn node4-9 node4-10)
    (conn node4-10 node4-9)
    (conn node4-10 node4-11)
    (conn node4-11 node3-11)
    (conn node4-11 node5-11)
    (conn node4-11 node4-10)
    (conn node5-2 node4-2)
    (conn node5-2 node6-2)
    (conn node5-2 node5-3)
    (conn node5-3 node4-3)
    (conn node5-3 node6-3)
    (conn node5-3 node5-2)
    (conn node5-6 node4-6)
    (conn node5-6 node6-6)
    (conn node5-6 node5-7)
    (conn node5-7 node4-7)
    (conn node5-7 node6-7)
    (conn node5-7 node5-6)
    (conn node5-9 node4-9)
    (conn node5-9 node6-9)
    (conn node5-11 node4-11)
    (conn node5-11 node6-11)
    (conn node6-1 node7-1)
    (conn node6-1 node6-2)
    (conn node6-2 node5-2)
    (conn node6-2 node6-1)
    (conn node6-2 node6-3)
    (conn node6-3 node5-3)
    (conn node6-3 node6-2)
    (conn node6-3 node6-4)
    (conn node6-4 node7-4)
    (conn node6-4 node6-3)
    (conn node6-4 node6-5)
    (conn node6-5 node6-4)
    (conn node6-5 node6-6)
    (conn node6-6 node5-6)
    (conn node6-6 node6-5)
    (conn node6-6 node6-7)
    (conn node6-7 node5-7)
    (conn node6-7 node7-7)
    (conn node6-7 node6-6)
    (conn node6-9 node5-9)
    (conn node6-9 node7-9)
    (conn node6-11 node5-11)
    (conn node6-11 node7-11)
    (conn node7-1 node6-1)
    (conn node7-1 node8-1)
    (conn node7-4 node6-4)
    (conn node7-4 node8-4)
    (conn node7-7 node6-7)
    (conn node7-7 node8-7)
    (conn node7-9 node6-9)
    (conn node7-11 node6-11)
    (conn node7-11 node8-11)
    (conn node8-1 node7-1)
    (conn node8-1 node9-1)
    (conn node8-4 node7-4)
    (conn node8-4 node9-4)
    (conn node8-7 node7-7)
    (conn node8-7 node9-7)
    (conn node8-11 node7-11)
    (conn node8-11 node9-11)
    (conn node9-1 node8-1)
    (conn node9-1 node10-1)
    (conn node9-1 node9-2)
    (conn node9-2 node9-1)
    (conn node9-2 node9-3)
    (conn node9-3 node9-2)
    (conn node9-3 node9-4)
    (conn node9-4 node8-4)
    (conn node9-4 node10-4)
    (conn node9-4 node9-3)
    (conn node9-4 node9-5)
    (conn node9-5 node9-4)
    (conn node9-5 node9-6)
    (conn node9-6 node9-5)
    (conn node9-6 node9-7)
    (conn node9-7 node8-7)
    (conn node9-7 node10-7)
    (conn node9-7 node9-6)
    (conn node9-7 node9-8)
    (conn node9-8 node9-7)
    (conn node9-8 node9-9)
    (conn node9-9 node9-8)
    (conn node9-9 node9-10)
    (conn node9-10 node10-10)
    (conn node9-10 node9-9)
    (conn node9-10 node9-11)
    (conn node9-11 node8-11)
    (conn node9-11 node9-10)
    (conn node10-1 node9-1)
    (conn node10-1 node11-1)
    (conn node10-4 node9-4)
    (conn node10-4 node11-4)
    (conn node10-7 node9-7)
    (conn node10-7 node11-7)
    (conn node10-10 node9-10)
    (conn node10-10 node11-10)
    (conn node11-1 node10-1)
    (conn node11-4 node10-4)
    (conn node11-7 node10-7)
    (conn node11-10 node10-10)
  )
  (:goal (and (at-robot node11-4 robot)))
)

; plan
1. (move node1-1 node2-1 robot)
   deleted: (at-robot node1-1 robot)
   added: (at-robot node2-1 robot)
   goals met: 0 of 1
2. (move node2-1 node3-1 robot)
   deleted: (at-robot node2-1 robot)
   added: (at-robot node3-1 robot)
   goals met: 0 of 1
3. (move node3-1 node4-1 robot)
   deleted: (at-robot node3-1 robot)
   added: (at-robot node4-1 robot)
   goals met: 0 of 1
4. (move node4-1 node4-2 robot)
   deleted: (at-robot node4-1 robot)
   added: (at-robot node4-2 robot)
   goals met: 0 of 1
5. (move node4-2 node4-3 robot)
   deleted: (at-robot node4-2 robot)
   added: (at-robot node4-3 robot)
   goals met: 0 of 1
6. (move node4-3 node5-3 robot)
   deleted: (at-robot node4-3 robot)
   added: (at-robot node5-3 robot)
   goals met: 0 of 1
7. (move node5-3 node6-3 robot)
   deleted: (at-robot node5-3 robot)
   added: (at-robot node6-3 robot)
   goals met: 0 of 1
8. (move node6-3 node6-4 robot)
   deleted: (at-robot node6-3 robot)
   added: (at-robot node6-4 robot)
   goals met: 0 of 1
9. (move node6-4 node7-4 robot)
   deleted: (at-robot node6-4 robot)
   added: (at-robot node7-4 robot)
   goals met: 0 of 1
10. (move node7-4 node8-4 robot)
   deleted: (at-robot node7-4 robot)
   added: (at-robot node8-4 robot)
   goals met: 0 of 1
11. (move node8-4 node9-4 robot)
   deleted: (at-robot node8-4 robot)
   added: (at-robot node9-4 robot)
   goals met: 0 of 1
12. (move node9-4 node10-4 robot)
   deleted: (at-robot node9-4 robot)
   added: (at-robot node10-4 robot)
   goals met: 0 of 1
13. (move node10-4 node11-4 robot)
   deleted: (at-robot node10-4 robot)
   added: (at-robot node11-4 robot)
   goals met: 1 of 1
